xeon/20240731-2049-glibc-tuned/logs/pgbench-yes-512-1000-1/pgbench.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 5
partition method: range
partitions: 1
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 5786209
number of failed transactions: 0 (0.000%)
latency average = 0.055 ms
initial connection time = 28.962 ms
tps = 580258.796505 (without initial connection time)